{
  "jira": {
    "assign": {
      "error": {
        "api": "The JIRA API returned an error when creating. Make sure your registration is correct, say \"whoami\" in a private conversation with me to find your the username you're currently registered with."
      },
      "success": "I successfully assigned you to issue {{issueKey}}. Please doublecheck JIRA just to be sure. Robots make mistakes you know."
    },
    "register": {
      "success": "Your registration was successfull with username: {{username}}. If you want to change your registration say `register \"[username]\"` again.",
      "error": {
        "no_email": "It seems like you send me an email address, please try again and use the username from your profile instead.",
        "no_result": "I can't seem to find your username, please make sure you send me your username between double quotes (`register \"[username]\"`)."
      }
    },
    "link": {
      "success": "The link between {{issue1}} & {{issue2}} was successfully created. Please double check JIRA to make sure that it was done correctly.",
      "error": {
        "api": "I tried to link two issues but I failed. :disappointed: There was an error when requesting the API, please try again later",
        "message": "I tried to link two issues but I failed. :disappointed: I couldn't find the link type in your message. Please follow the following pattern: *link REF-<number> is blocked by RE-<number>*. Link type can be one of the following: is blocked by, relates to, is duplicated by or is caused by."
      }
    },
    "find": {
      "assignee": "Assignee",
      "no_assignee": "No one",
      "status": "Status",
      "error": {
        "not_found": "I thought I heard you talking about an issues just a second ago, but I was unable to find it on JIRA. I'm sorry. :disappointed:"
      }
    },
    "whoami": {
      "title": "Your user data",
      "text": "This is the data that I have from <@{{userId}}>",
      "field": {
        "jira_username": "Jira username"
      }
    }
  },
  "help": {
    "text": "I have a lot of features. They trigger based on different words. This can be confusing sometimes, even though they are quite straight forward. Here is a list of my skills:",
    "assign": {
      "title": "Assign me to [issueKey]",
      "text": "This will assign you to the issueKey you mention. This requires a the register process to be completed.\n_Triggers in:_ direct message and mention"
    },
    "link": {
      "title": "Link [issueKey1] is [\"blocked by\", \"duplicated by\", \"caused by\", \"related to\"] [issueKey2]",
      "text": "Link the issueKey1 to IssueKey2 with a type that you specify.\n_Triggers in:_ direct message and mention"
    },
    "register": {
      "title": "Register \"[JIRA Username]\"",
      "text": "Register yourself with your JIRA username to be able to use the user specific commands.\n_Triggers in:_ direct message"
    },
    "whoami": {
      "title": "Whoami",
      "text": "Show the user if you finished the register process.\n_Triggers in:_ direct message"
    }
  },
  "storage": {
    "error": {
      "user_get": "There was a problem when getting you from the database. Please say \"register\" in a private conversation with me to start the registration process.",
      "user_none": "I was unable to find you in my brain. Please say \"register\" in a private conversation with me to start the registration process.",
      "save": "Something went wrong while saving, I'm sorry. :disappointed: Please try again, if it still doesn't work contact my creator Johan van Eck."
    }
  },
  "meta": {
    "love": "Aahh... I love you too! :heart: But just know that I will never love you like I love my creator: Johan van Eck."
  }
}
